# -*- coding: utf-8 -*-
# 这是开篇、游戏教程的部分

from machine import Machine
from coin import Coin
from task import Task, TaskManager
from game_pics import bottle_pics, coin_pics
from useful_methods.space_counter import my_len, space_counter
from useful_methods.color_phrase import makeWordsColor
from useful_methods.my_print import my_print
from shared_userdata import UserData
import os
import sys
import time

BASE_DIR = os.path.dirname(sys.executable) if getattr(sys, 'frozen', False) else os.path.dirname(__file__)

with open(os.path.join(BASE_DIR, "play_time.txt"), "r", encoding="utf-8") as f:
    play_time = int(f.read())

def clear():
    os.system('cls' if os.name == 'nt' else 'clear')

class uiscreenTitle():
    
    def highlight_info(word):
        '''输入字符，如果字符=当前选中的内容，返回亮黄色字来代表选中的按钮'''
        return word
        '''
        if word == UserData.user_chosen:
            return makeWordsColor(word, "lightyellow")
        return word
        '''

    def printTitle():
        '''标题画面'''
        title_pic = f"""            ╭──────────────────────────────────────────────────────────╮ 
            │  the                                                     │
            │  ╭─── ┌─── ┐    ┐    ─┬─ ┌┐ ┬ ╭──┐                       │
            │  ╰──╮ ├──  │    │     │  ││ │ │ ─┬                       │
            │  ───╯ └─── └─── └─── ─┴─ ┴└─┘ └──┘                       │
            │      ┌┬─╮ ╭──╮ ╭──╮ ┬  ┬ ─┬─ ┌┐ ┬ ┌───                   │
            │      ││ │ ├──┤ │    ├──┤  │  ││ │ ├──                    │
            │      ┘┴ ┘ ┴  ┴ ╰──╯ ┴  ┴ ─┴─ ┴└─┘ └───  TM               │
            │                                                          │
            │      ————— 售货机物语              ╭─╮                   │
            │                                    ├-┤                   │
            │               ╭─────────╮         ╭╯ ╰╮                  │
            │               │ {uiscreenTitle.highlight_info("开始游戏")}│         │ ʙɛ│______            │
            │               ├─────────┤         │ ɛʀ││‾‾‾‾├╮┌─╱┐       │
            │               │ {uiscreenTitle.highlight_info("玩法教程")}│         │   ││café├╯│ D│┌/┐    │
            │               ╰─────────╯         ╰───╯╰────╯ ╰──╯╰─╯    │
            │                                                          │
            │                                                          │
            │                                                Beta V1.3 │
            ╰──────────────────────────────────────────────────────────╯"""
        print(title_pic)

    def sectionStartPage(section_num):
        '''打印每章开头的引言介绍'''
        if section_num == 1:
            chap_1_page_1 = '''            ╭────────────────────────────────────────────────────────╮
            │                                                        │
            │   ╭──╮┐              ┌┐                                │
            │   │   ├─╮╭─╮┌─╮─┼─    │                 ─┬───┬─        │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─                 │   │         │
            │             ┴                         ───┼───┼───      │
            │                                          │   │         │
            │                                          │   │         │
            │                                                        │   
            │                                                        │
            │                                                        │
            │                                        ┐   │ │ │       │
            │                                       ─┴─  └─┴─┘       │
            │                                       │ │ ───┬───      │
            │                                       ─── ┌─┬┴┬─┐      │
            │                                           │ │ │ │      │
            │    我们的旅途，                                        │
            │                                                        │
            │       从这里开始。                 难度  ■ □ □ □ □     │
            │                                                        │
            ╰────────────────────────────────────────────────────────╯
        '''
            chap_1_page_2 = '''            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐              ┌┐           章  节  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─    │      ───────────────────────    │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─     I N T R O D U C T I O N    │
            │             ┴                                           │
            │   ┌─────────────────────────────────────────────────┐   │
            │   │    欢迎来到异次元的世界！                       │   │
            │   │    本时空的文明以高度发达的售卖系统著称。       │   │   
            │   │    但我们不卖其他，只卖一种物品：瓶装饮料。     │   │
            │   │                                                 │   │
            │   │    这解释起来有些复杂。比如说，我们不需要摄入固 │   │
            │   │体，而以电池酸液和烷烃饮料为生。进一步解释我们的 │   │
            │   │构造容易产生不必要的困惑。                       │   │
            │   │    幸运的是，本章提供的五种饮料：               │   │
            │   │            \033[93m水、咖啡、果汁、茶、牛奶\033[0m             │   │
            │   │                                                 │   │
            │   │    均为地球上最常见的饮料种类。[统计编号0328]   │   │
            │   │                                                 │   │
            │   └─────────────────────────────────────────────────┘   │
            │                                                         │
            ╰─────────────────────────────────────────────────────────╯
        '''
            chap_1_page_3 = '''            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐              ┌┐            章 节 一 览          │
            │   │   ├─╮╭─╮┌─╮─┼─    │        ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─          P R E V I E W         │
            │             ┴                                           │
            │                                                         │
            │                                                         │
            │    ╭o╮ 生命   ╭o╮ 醇香   ╭o╮ 酸甜  ╭o╮ 一盏  ╭o╮ 素液   │
            │    │~│ 之源   │É│ 提神   │J│ 可口  │T│ 清欢  │M│ 润心   │ 
            │    ╰─╯        ╰─╯        ╰─╯       ╰─╯       ╰─╯        │ 
            │    水         咖啡       果汁      茶        牛奶       │ 
            │                                                         │
            │                                                         │
            │                                       ___               │ 
            │    ______     ┬──╱─┬    ┬──╱─┬     ╭──╯│╰╮              │
            │    │‾‾‾‾├╮    │~╱~~│    │*╱~*│     │  o┼o│              │ 
            │    │café├╯    │╱ooo│    │╱~*~│     │ψ  ┼o│              │
            │    ╰────╯     ╰────╯    ╰────╯     ╰─────╯              │ 
            │   卡布奇诺     奶茶    水果味奶昔    果茶               │
            │                                                         │ 
            ╰─────────────────────────────────────────────────────────╯
        '''
            print(chap_1_page_1)
            input("            >>> 按回车进入下一页。")
            clear()
            print(chap_1_page_2)
            input("            >>> 按回车进入下一页。")
            clear()
            print(chap_1_page_3)
            input("            >>> 按回车开始游戏。")
            clear()
        elif section_num == 2:
            chap_2_page_1 = """            ╭────────────────────────────────────────────────────────╮
            │                                                        │
            │   ╭──╮┐              ┌─┐                               │
            │   │   ├─╮╭─╮┌─╮─┼─   ┌─┘              ─┐  ─┬──┬─       │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   └──              ─┐  ┌┼──┼┐       │
            │             ┴                             ││  ││       │
            │                                        │  │ ── │       │
            │                                       ─┘  └────┘       │
            │                                                        │   
            │                                                        │
            │                                             ───        │
            │                                        ──  ├─┬─┐       │
            │                                       ─┬── ├─┼─┤       │
            │                                        │   └─┼─┘       │
            │                                        └─┘  ╱│ └┘      │
            │                                            ╱ └───┘     │
            │    对酒当歌，                                          │
            │                                                        │
            │       人生几何？                 难度  ■ ■ □ □ □       │
            │                                                        │
            ╰────────────────────────────────────────────────────────╯
"""
            chap_2_page_2 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐              ┌─┐          章  节  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─   ┌─┘     ───────────────────────    │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   └──     I N T R O D U C T I O N    │
            │             ┴                                           │
            │   ┌─────────────────────────────────────────────────┐   │
            │   │    初次体验，感觉如何？                         │   │
            │   │                                                 │   │   
            │   │    前方是“酒鬼”的家园：我们为您添置了“酒精饮料” │   │
            │   │一种喝下去苦，但也会损害细胞的垃圾饮料。         │   │
            │   │                                                 │   │                   
            │   │    即便如此，大量的人沉迷酒精，为求那一刻的怅然 │   │
            │   │与沉醉。这一点上，人类文明与我们的文明并无差别， │   │
            │   │尽管我们喝的是另一种星际麻醉饮料。               │   │
            │   │                                                 │   │
            │   │    本章的基底饮料为：                           │   │
            │   │         \033[93m水、酸奶、果汁、茶、酒精饮料\033[0m            │   │
            │   │                                                 │   │
            │   │                                                 │   │
            │   └─────────────────────────────────────────────────┘   │
            │                                                         │
            ╰─────────────────────────────────────────────────────────╯
"""
            a = '\033[90m\033[0m'
            chap_2_page_3 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐              ┌─┐           章 节 一 览          │
            │   │   ├─╮╭─╮┌─╮─┼─   ┌─┘       ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─   └──          P R E V I E W         │
            │             ┴                                           │
            │                                                         │
            │                                                         │
            │     ╭o╮ ╭o╮ ╭o╮          ╭o╮ 醉生        醇厚           │
            │     │~│ │J│ │T│    +     │Å│ 梦死   ┌─╱┐ 绵柔           │ 
            │     ╰─╯ ╰─╯ ╰─╯          ╰─╯        ╰──╯                │ 
            │     水  果汁 茶           酒        酸奶                │ 
            │                                                         │
            │                                                         │
            │       ___              ╭┬──╮               ┌─────│╮     │ 
            │    ╭──╯│╰╮    │___│    │╰──┤     ┌──╱┐     │.....││     │
            │    │  o┼o│    │   │    │  ʙ│     │D╱D│     │.oo..││     │ 
            │    │ψ  ┼o│    ╰─╥─╯    │   │     │ D │     │.O..o.│     │      
            │    ╰─────╯     ─╨─     ╰───╯     ╰───╯     ╰──────╯     │       
            │      果茶      红酒     啤酒    水果酸奶    甜酒酿      │
            │                                                         │ 
            ╰─────────────────────────────────────────────────────────╯
"""
            print(chap_2_page_1)
            input("            >>> 按回车进入下一页。")
            clear()
            print(chap_2_page_2)
            input("            >>> 按回车进入下一页。")
            clear()
            print(chap_2_page_3)
            input("            >>> 按回车开始游戏。")
            clear()

class uiscreenBeginning():
    def printBeginning():
        '''游戏开始时播放内容'''
        if play_time == 0:
            my_print(".. .. .· ··. .·.?", 0.2)
            time.sleep(1)
            my_print("···. ·...·.·.. .· ·...··..· ·..·.。", 0.1)
            time.sleep(0.5)
            print()
            my_print("表示语言：[中文] 已切换", 0)
            time.sleep(0.5)
            # part 1
            print()
            print("世界名：", end = "")
            my_print("0A9B134PX9SD1SJ3B348M2M10DF", 0.1)
            time.sleep(0.2)
            print("世界状态：", end = "")
            my_print("(0t)021011", 0.1)
            time.sleep(0.2)
            print("世界状态（自然语言）：", end = "")
            my_print("稳定循环", 0.1)
            time.sleep(0.2)
            print("世界平均熵增速率：", end = "")
            my_print("3.823e14J/K*s", 0.1)
            time.sleep(1)
            
            # part 2
            print()
            print("连接方式：", end = "")
            my_print("梦境接口", 0.1)
            time.sleep(0.2)
            print("本主机：", end = "")
            my_print("EDC M50 特快型", 0.1)
            time.sleep(0.2)
            print("终端主机：", end = "")
            my_print("类计算单位", 0.1)
            time.sleep(0.2)

            # part 3
            print()
            print("特定时空1名称：", end = "")
            my_print("泇鬱超星系团·E03J2DC秩序梦境接口研究星群", 0.1)
            time.sleep(0.5)
            print()
            print("坐标：", end = "")
            time.sleep(1)
            my_print("（*DPX加密，*DPX加密，*DPX加密，*DPX加密）", 0)
            time.sleep(0.2)
            print()
            print("特定时空2名称：", end = "")
            my_print("拉尼亚凯亚超星系团·室女座超星系团·\n本星系群·银河系·猎户臂·太阳系·地球·\n实体(0t)0122101100210200012010120110200120110021", 0.05)
            time.sleep(0.5)
            print()
            print("坐标：", end = "")
            time.sleep(1)
            my_print("（*DPX加密，*DPX加密，*DPX加密，*DPX加密）", 0)
            time.sleep(0.2)
            print()
            print("连接方式：", end = "")
            my_print("正在连接", 0.05, "")
            my_print("........", 1)
            
            # part 4
            radius_pic_info = """    ╭──────────────────────────────────────────────────────────╮ 
    │坐标形式：四维时空坐标(ct,  x,   y,   z)                  │
    │                      (秒,光年,光年,光年)                 │
    │                                                          │
    │以泇鬱超星系团·E0DC秩序中心激活瞬间时空为 (0,0,0,0)       │
    │向量方向参照概览：                                        │
    │                                                          │
    │                      z                                   │
    │                     ╱                S40                 │
    │                    ╱             (1e5,5,-2,2)            │
    │                   ╱                                      │
    │               E0DC ────────────x                         │
    │            (0,0,0,0)-                                    │
    │                   ╲    -         ╱                       │
    │                    ╲       -    ╱                        │
    │                     ╲          -──────                   │
    │                      y         ╲   -                     │
    │                                 ╲       -                │
    │                                             ct           │
    │                                                          │
    ╰──────────────────────────────────────────────────────────╯"""
            clear()
            print("连接方式：")
            print(radius_pic_info)
            time.sleep(3)
            my_print("\033[31m[警告：根据主世界秩序保密协议，终端标识及坐标已从向量参考图中移除。]\033[0m", 0.1)
            print()
            print("连接进度：|                     |  0%")
            time.sleep(1)
            print("\033[1A\033[K连接进度：|xx                   |  10%")
            time.sleep(1)
            print("\033[1A\033[K连接进度：|xxx                  |  15%")
            time.sleep(4)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxx        |  60%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxx       |  65%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxx      |  70%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxx     |  75%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxx    |  80%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxxx   |  85%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxxxx  |  90%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxxxxx |  95%")
            time.sleep(0.5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxxxxxx|  99%")
            time.sleep(5)
            print("\033[1A\033[K连接进度：|xxxxxxxxxxxxxxxxxxxxx|  100%")
            time.sleep(1)
            clear()

            # part 5
            time.sleep(1)
            my_print("已连接：类计算单位", 0.1)
            my_print("\033[31m[警告： 终端主机的可计算规模远低于基本世界框架的运行需求。仍要继续执行吗？(y/N)]\033[0m", 0.1)
            my_print("y", 0.1)
            time.sleep(2)
            clear()
            time.sleep(1)
            uiscreenTitle.printTitle()

class uiscreenTutorial():
    def printTutorial():
        '''新手教程'''
        tutorial_page_1 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     饮料分为基底饮料和混合饮料两种。                    │
            │                                                         │ 
            │                                                         │ 
            │                                        _______          │
            │            ╭o╮╭〇╮                 ╭┬─╮│‾‾‾‾‾├╮         │
            │         ╭o╮│T││  │            ┬─╱─┬│╰─┤│     ││         │ 
            │      ╭o╮│M││ ││  │            │╱oo││ ʙ││ café├╯         │
            │      ╰─╯╰─╯╰─╯╰──╯            ╰───╯╰──╯╰─────╯          │
            │                                                         │ 
            │         基底饮料                   混合饮料             │
            │                                                         │
            │                                                         │ 
            │                                                         │
            │                                                         │
            ╰─────────────────────────────────────────────────────────╯
    """
        tutorial_page_2 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     基底饮料是饮料的“最小单位”，                        │
            │                                                         │
            │     将基底饮料按照一定方式混合可得到混合饮料。          │ 
            │     例如：                                              │ 
            │                                                         │ 
            │                                                         │
            │          ╭o╮           ╭o╮             ┬─╱─┬            │
            │          │M│     +     │T│     -->     │╱oo│            │ 
            │          ╰─╯           ╰─╯             ╰───╯            │
            │          牛奶           茶              奶茶            │
            │          500ml        500ml            1000ml           │ 
            │                                                         │ 
            │                                                         │
            │                                                         │
            ╰─────────────────────────────────────────────────────────╯
    """
        tutorial_page_3 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     基底饮料的种类和体积大小决定了混合饮料的种类和大小。│
            │                                                         │
            │     基底饮料体积相加为混合饮料的体积。例如：            │
            │                                                         │ 
            │          ╭o╮           ╭o╮             ┬─╱─┬            │ 
            │          │M│     +     │T│     -->     │╱oo│            │ 
            │          ╰─╯           ╰─╯             ╰───╯            │ 
            │         正常瓶         正常瓶          迷你杯           │
            │         500ml          500ml           1000ml           │
            │                                                         │
            │                        ╭o╮             ┬──╱─┬           │
            │          ╭o╮           │T│             │~╱~~│           │
            │          │M│     +     │ │     -->     │╱ooo│           │ 
            │          ╰─╯           ╰─╯             ╰────╯           │
            │         正常瓶         大号瓶           正常杯          │
            │         500ml          750ml            1250ml          │ 
            │                                                         │
            ╰─────────────────────────────────────────────────────────╯
    """
        tutorial_page_4 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     更多示例：                                          │
            │                                                         │
            │          ╭o╮           ╭o╮             ┬─╱─┬            │ 
            │          │M│     +     │T│     -->     │╱oo│            │ 
            │          ╰─╯           ╰─╯             ╰───╯            │ 
            │          牛奶           茶              奶茶            │
            │                                                         │
            │                                        ____             │
            │          ╭o╮           ╭o╮             │‾‾├╮            │
            │          │M│     +     │É│     -->     │fé├╯            │ 
            │          ╰─╯           ╰─╯             ╰──╯             │
            │          牛奶          咖啡            卡布奇诺         │
            │                                                         │ 
            │                                                         │
            │                                                         │
            │                                                         │ 
            ╰─────────────────────────────────────────────────────────╯
    """
        tutorial_page_5 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     不妥当的混合方式会产生毒药：                        │                
            │                                        ____             │
            │          ╭o╮           ╭o╮             │‾‾├╮            │
            │          │M│     +     │É│     -->     │fé├╯            │ 
            │          ╰─╯           ╰─╯             ╰──╯             │
            │          牛奶          咖啡            卡布奇诺         │
            │                                                         │ 
            │                                        ____             │
            │          ╭o╮           ╭o╮             │  │             │
            │          │J│     +     │É│     -->     │╳╳│             │
            │          ╰─╯           ╰─╯             ╰──╯             │ 
            │          果汁          咖啡             毒药            │
            │                                                         │
            │                                                         │ 
            │     毒药会导致扣钱（钱的概念即将在后面的介绍中出现）    │ 
            │                                                         │ 
            │     一般来说，现实生活中不曾想象的黑暗组合才会产生毒药。│                                     
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_6 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     两次以上的混合在后续章节会陆续出现。                │                
            │     在本章，这种混合均会产生毒药：                      │
            │                                                         │
            │                                                         │ 
            │          ____                           ______          │ 
            │          │‾‾├╮          ┬─╱─┬           │    │          │
            │          │fé├╯    +     │╱oo│   -->     │╳╳╳╳│          │ 
            │          ╰──╯           ╰───╯           ╰────╯          │
            │         卡布奇诺         奶茶             毒药          │
            │          迷你            迷你             正常          │ 
            │                                                         │
            │                                                         │ 
            │                                                         │ 
            │                                                         │
            │                                                         │ 
            │                                                         │ 
            │                                                         │ 
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_7 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     大多数基底饮料有迷你、正常、长、大号四种型号的变种。│                                                 
            │                                                         │
            │                                                         │
            │                       ╭o╮    ╭〇╮                       │ 
            │                ╭o╮    │M│    │ M│                       │
            │         ╭o╮    │M│    │ │    │  │                       │
            │         ╰─╯    ╰─╯    ╰─╯    ╰──╯                       │ 
            │         迷你   正常    长     大号                      │
            │                                                         │
            │     其体积分别为：                                      │            
            │                                                         │
            │        250ml  500ml  750ml   1000ml                     │
            │                                                         │
            │                                                         │
            │     体积是混合时游戏参考生成新饮料型号的标准。          │
            │                                                         │                                     
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_8 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     购买得到的基底瓶子的大小是随机的，有大有小。        │
            │     更大体积的饮料能在出售时卖得更多的钱，所以升级你的瓶│
            │   子大小相当重要。以下是升级大小的常见方法：            │                                
            │                                                         │
            │     · 将同名瓶子混合：                                  │
            │                                      ╭o╮                │ 
            │        ╭o╮           ╭o╮             │M│                │
            │        │M│     +     │M│     -->     │ │                │ 
            │        ╰─╯           ╰─╯             ╰─╯                │
            │        正常          正常             长                │ 
            │                                                         │
            │                                                _______  │ 
            │        ____          ____            ______    │‾‾‾‾‾├╮ │
            │        │‾‾├╮         │‾‾├╮           │‾‾‾‾├╮   │     ││ │ 
            │        │fé├╯   +     │fé├╯   -->     │café├╯   │ café├╯ │
            │        ╰──╯          ╰──╯            ╰────╯    ╰─────╯  │ 
            │        迷你          迷你              正常  or   大号  │
            │                                    总1250ml+   总2000ml+│                                     
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_9 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     水是一种特殊的基底饮料。任何饮料与水混合，在保留该饮│
            │   料的同时会扩大饮料的体积，且本游戏并无“稀释”的概念。  │
            │                                                         │
            │     · 将其他饮料与水混合：                              │
            │                                      ╭o╮                │ 
            │        ╭o╮           ╭o╮             │M│                │
            │        │M│     +     │~│     -->     │ │                │ 
            │        ╰─╯           ╰─╯             ╰─╯                │
            │        正常          正常             长                │ 
            │                                                         │
            │                                                         │ 
            │        ____                          ______             │
            │        │‾‾├╮         ╭o╮             │‾‾‾‾├╮            │ 
            │        │fé├╯   +     │~│     -->     │café├╯            │
            │        ╰──╯          ╰─╯             ╰────╯             │ 
            │        迷你          正常              正常             │
            │                                                         │                                     
            ╰─────────────────────────────────────────────────────────╯"""
        tutorial_page_10 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     有一种特殊的饮料，称为“幸运瓶子”。购买售货机里的商品│
            │   有概率获得正常大小且带问号的幸运瓶子。在结算时，它的结│
            │   算价格是随机的。                                      │
            │                                                         │ 
            │     任何其他饮料与幸运瓶子混合，都将保留并扩大幸运瓶子。│ 
            │     两个幸运瓶子混合可以得到双拼幸运瓶子。              │
            │                                        ╭o╮              │
            │        ╭o╮           ┬─╱─┬             │?│              │
            │        │?│     +     │╱oo│     -->     │ │              │
            │        ╰─╯           ╰───╯             ╰─╯              │
            │      幸运瓶子         奶茶            幸运瓶子          │
            │                                                         │ 
            │        ╭o╮            ╭o╮             ╭o╮╭o╮            │
            │        │?│     +      │?│      -->    │?├┤?│            │
            │        ╰─╯            ╰─╯             ╰─╯╰─╯            │  
            │      幸运瓶子        幸运瓶子        双拼幸运瓶子       │      
            │                                                         │    
            │     或许，你可以尝试用幸运瓶子来覆盖不小心得到的毒药。  │                               
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_11 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │   ╭──╮┐                           规  则  介  绍        │
            │   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
            │   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
            │             ┴                                           │
            │                                                         │
            │     介绍完饮料的知识，我们将视野移向货币系统。          │
            │                                                         │
            │     以下是6种游戏的“芯片硬币”，是游戏的通用货币。       │                                       
            │                                                         │
            │                                                         │
            │          ╭────╮  ╭──╮  ╭─╮                              │ 
            │          │    ╰╮ │  ╰╮ │ ╰╮ ╭──╮ ╭─╮ ╭─╮                │ 
            │          │ 500 │ │100│ │50│ │10│ │5│ │1│                │  
            │          ╰─────╯ ╰───╯ ╰──╯ ╰──╯ ╰─╯ ╰─╯                │
            │                                                         │  
            │     上面的数字代表硬币的面值。                          │
            │                                                         │ 
            │     芯片硬币是你在本世界通行的前提，用该硬币在“饮料售货 │
            │   机”中购买多种基底饮料，混合他们来拍卖以赚取更多硬币。 │ 
            │                                                         │  
            │     当你的硬币亏损到不足以购买任何饮料时，你就失败了。  │     
            ╰─────────────────────────────────────────────────────────╯
"""
        tutorial_page_12 = """            ╭───────────────────────────────────────────────────────────╮
            │    +—————————————————————+                                │
            │   ╱/////////////////////╱|                                │
            │  +—————————————————————+ |  这就是我们引以为傲的售货机。  │
            │  |  Selling  Machine   |╱|  一共有两行，每行7个售卖位置。 │
            │  |_____________________| |                                │
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|  ╭────╮ ╭────╮                 │
            │  |│1││2││3││4││5││6││7│| |  │    ╰╮│    ╰╮                │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|  │ 500 ││ 500 │                │
            │  |─────────────────────| |  ╰─────╯╰─────╯                │
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|                                │
            │  |│1││2││3││4││5││6││7│| |  上面是你的初始硬币。          │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|  游戏正式开始时，键入“500”数字 │
            │  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |  以完成一次投币。              │
            │  | IN 0000 │  ╭╮   ╭╮  | |                                │
            │  |—————————│  ╰╯   ╰╯  | +  键入想要购买的饮料位置，      │
            │  |OUT 0000 │Coin Charge|╱|  例如“A2” “B1”等，以完成购买。 │
            │  +—————————+———————————+ |                                │
            │  |   ┌─────────────┐   | |  购买后会自动找零。            │
            │  |   │             │   | |  如果想要先退回投入售货机的硬币│
            │  |   │             │   | +  请键入“退钱”。                │
            │  |   └─────────────┘   |╱   此操作不能退还已经交易过的硬币│
            │  +—————————————————————+                                  │
            ╰───────────────────────────────────────────────────────────╯
            """
        tutorial_page_13 = """            ╭───────────────────────────────────────────────────────────╮
            │    +—————————————————————+                                │
            │   ╱/////////////////////╱|                                │
            │  +—————————————————————+ |  购买后，饮料瓶会依序排列在售货│
            │  |  Selling  Machine   |╱|  机的右侧偏下的位置。          │
            │  |_____________________| |                                │
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|  如下图：                      │
            │  |│1││2││3││4││5││6││7│| |  序号依次为：1, 2, 3, 4        │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                                │
            │  |─────────────────────| |  待剩下的钱不足以买任何一种饮料│
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|  时，才能开始混合阶段：        │
            │  |│1││2││3││4││5││6││7│| |                                │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                                │
            │  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |         ╭o╮                    │
            │  | IN 0000 │  ╭╮   ╭╮  | |   ╭o╮╭o╮│ │╭o╮                 │
            │  |—————————│  ╰╯   ╰╯  | +   │M││T││ ││É│                 │
            │  |OUT 0000 │Coin Charge|╱|   ╰─╯╰─╯╰─╯╰─╯                 │
            │  +—————————+———————————+ |                                │
            │  |   ┌─────────────┐   | |  混合时，键入“1+4”代表混合第一 │
            │  |   │             │   | |  个瓶子与第四个瓶子            │
            │  |   │             │   | +                                │
            │  |   └─────────────┘   |╱   你认为所有混合已经完成时，    │
            │  +—————————————————————+    键入“结算”来结算本回合的饮料。│
            ╰───────────────────────────────────────────────────────────╯
"""
        tutorial_page_14 = """            ╭─────────────────────────────────────────────────────────╮
            │    +—————————————————————+                              │
            │   ╱/////////////////////╱|                              │
            │  +—————————————————————+ |   主界面一共有2页。刚才向你介│
            │  |  Selling  Machine   |╱|   绍的内容为第1页。          │
            │  |_____________________| |                              │
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|   要切换页面，键入“P2”至第2页│
            │  |│1││2││3││4││5││6││7│| |              键入“P1”至第1页 │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                              │
            │  |─────────────────────| |   第 1 页功能：              │
            │  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|                              │
            │  |│1││2││3││4││5││6││7│| |        · 投币                │
            │  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|        · 购买基底饮料        │
            │  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |        · 混合（不能购买之后）│
            │  | IN 0000 │  ╭╮   ╭╮  | |        · 结算                │
            │  |—————————│  ╰╯   ╰╯  | +                              │
            │  |OUT 0000 │Coin Charge|╱|   第 2 页功能：              │
            │  +—————————+———————————+ |                              │
            │  |   ┌─────────────┐   | |        · 查看章节附加任务进度│
            │  |   │             │   | |        · 储蓄卡存钱/取钱     │
            │  |   │             │   | +                              │
            │  |   └─────────────┘   |╱                               │
            │  +—————————————————————+                                │
            ╰─────────────────────────────────────────────────────────╯"""
        tutorial_page_15 = """            ╭─────────────────────────────────────────────────────────────╮
            │                                                             │
            │   ╭────────────────────────────────────╮                    │
            │   │╭─╮╭─╮╭─╮╭─╮   Savings Bank     ╭o╮ │                    │
            │   │╰─╯╰─╯╰─╯╰─╯                 ╭o╮│ │ │                    │
            │   │ ╭────╮            ╭──╮      ╰─╯╰─╯ │                    │
            │   │ │    ╰╮           │  ╰╮            │                    │ 
            │   │ │ 500 │ x  000    │100│ x  000     │                    │
            │   │ ╰─────╯           ╰───╯            │                    │
            │   │                             000.0k │                    │
            │   ╰────────────────────────────────────╯                    │
            │   这是你的储蓄卡。                                          │
            │   如果你不想每次都必须在回合内花完所有的钱，你可以选择存钱至│
            │ 储蓄卡。储蓄卡内的硬币将保留至之后的回合中。当你一回合破产但│
            │ 储蓄卡内还有存余时，你不会立刻结束游戏。                    │
            │                                                             │
            │    储蓄卡仅支持大额硬币（100/500）存入。                    │
            │    使用方法：进入第 2 页， 输入S100/S500 表示存100/500      │
            │                          输入W100/w500 表示取100/500        │
            │                                                             │
            ╰─────────────────────────────────────────────────────────────╯"""
        tutorial_page_16 = """            ╭─────────────────────────────────────────────────────────╮
            │                                                         │
            │            一 些 可 能 对 你 有 用 的 信 息             │
            │                                                         │
            │                                                         │
            │     · 回合结束结算的拍卖价格：                          │
            │                                                         │
            │                 水：        购入价 x 0.3                │
            │       其他基底饮料：        购入价 x 0.65               │
            │           混合饮料：       混合前两者购入价之和 x 1.1   │
            │               毒药：       -200                         │
            │           幸运瓶子：       期望值200，极差1200          │
            │                           （在-400~800间随机）          │
            │       双拼幸运瓶子：       期望值400，极差2400          │
            │                           （在-800~1600间随机)          │
            │                                                         │
            │     · 瓶子尺寸的价格倍率加成：                          │
            │                                                         │
            │              迷你：       价格 x 0.7                    │
            │              正常：       价格 x 1.0                    │
            │              长：         价格 x 1.3                    │
            │              大号：       价格 x 1.6                    │
            │       (幸运瓶子）                                       │
            │              长长：       价格 x 2.0                    │
            │            长长长：       价格 x 3.0                    │
            │                                                         │
            │   因此，尽可能多的混合瓶子，并适当地用水扩大体积，是较为│
            │ 划算的方式。                                            │
            ╰─────────────────────────────────────────────────────────╯"""
        tutorial_page_17 = """            ╭──────────────────────────────────────────────────────────────╮
            │                                                              │
            │            一 些 可 能 对 你 有 用 的 信 息                  │
            │                                                              │
            │                                                              │
            │     · 每过1个回合，售货机贩卖物品的价格都会通胀。不过在结算  │
            │       饮料时价格也会乘以相同的倍率。                         │
            │                                                              │
            │         新的售价为：   旧价格 * 110%                         │
            │                                                              │
            │       新的结算价为：   旧价格 * 110%                         │
            │                                                              │
            │       但储蓄卡的金额并不会改变。                             │
            │                                                              │
            │     · 每过1个回合，售货机都会随机补充随机数量的商品。        │
            │                                                              │
            │     · 每3回合为一章节，每一章节都会解锁一些全新的基底饮料。  │
            │       全新的混合饮料的配置方法默认保密，需要自行探索得到答案 │
            │       可以去图鉴（尚未完工）中查看已经遇到的各种饮料。       │
            │                                                              │
            │     · 售货机购买的瓶子上面的字样是否生成是随机的。随着游戏的 │
            │       深入，生成字样的概率会越来越低。字样用于提示瓶子的内容 │
            │       物，所以到后期记忆购买瓶子的顺序格外重要，以尽量减少混 │
            │       合失误。                                               │
            │       迷你瓶子均无字样，随着游戏的进行生成概率会提高。       │
            │       常见的字样为：                                         │
            │                                                              │
            │          M  -->  milk   牛奶         ╭o╮    ╭o╮              │
            │          J  -->  juice  果汁         │ │    │M│              │
            │          T  -->  tea    茶           ╰─╯    ╰─╯              │
            │          É  -->  coffee 咖啡        无字样  有字样           │
            │          ?  -->         幸运瓶                               │
            │                                                              │
            │                                                AlexDreemurr  │
            │                                                    25.08.27  │
            ╰──────────────────────────────────────────────────────────────╯"""
        clear()
        print(tutorial_page_1)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_2)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_3)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_4)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_5)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_6)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_7)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_8)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_9)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_10)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_11)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_12)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_13)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_14)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_15)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_16)
        input("            >>> 按回车进入下一页。")
        clear()
        print(tutorial_page_17)
        input("            >>> 按回车进入下一页。")
        clear()


#uiscreenTitle.printTitle()