# -*- coding: utf-8 -*-

from machine import Machine
from coin import Coin
from task import Task, TaskManager
from game_pics import bottle_pics, coin_pics
from useful_methods.space_counter import my_len, space_counter
from useful_methods.color_phrase import makeWordsColor
from shared_userdata import UserData

class Uiscreen():
    # page: 当前位于第几页
    # total_page_count: 总共有几页
    page = 1
    total_page_count = 2

    def display():
        '''显示游戏画面'''

        '''瓶子的显示状态：
            1：在售、投入的钱不够 -> 普通数字
            2：在售、投入的钱足够 -> 黑灰闪动数字
            3：被选中
            0：已售罄            -> 红色大叉'''

        # 数字字体
        small_number_under = "₁₂₃₄₅₆₇₈₉"
        small_number_above = "¹²³⁴⁵⁶⁷⁸⁹"
        large_number = "123456789"

        # 根据Machine信息设置每个瓶子的状态列表
        bottle_statuses = [1 for i in range(14)] 
        pivot = 0
        cur_status = 1
        for name in Machine.item_data:
            # 默认在售且钱不够
            cur_status = 1
            for i in range(len(Machine.item_data[name]["position"])):
                # 已售罄
                if Machine.item_data[name]["count"] <= 0:
                    cur_status = 0
                # 在售且投入足够钱
                elif Machine.caculateInputSum() >= Machine.item_data[name]["price"]:
                    cur_status = 2
                bottle_statuses[pivot] = cur_status
                pivot += 1

        # 不同状态下瓶子显示的图案
        def bottle_display(number, status):
            if status == 1:
                return large_number[number - 1]
            elif status == 2:
                return "\033[6m" + large_number[number - 1] + "\033[0m"
            elif status == 0:
                return "\033[31m" + "╳" + "\033[0m"
            elif status == 3:
                return "O"
        b = bottle_statuses
        bs = bottle_display

        # 商品信息列表（添加于售货机右侧）
        info_linelists = []
        for name in Machine.item_data:
            info_name = space_counter(name, 16)
            info_price = space_counter(str(Machine.item_data[name]["price"]), 9)
            info_count = space_counter(str(Machine.item_data[name]["count"]), 8)
            info_position = space_counter(" ".join(Machine.item_data[name]["position"]), 4)

            info_line = f"{info_name}{info_price}{info_count}{info_position}"
            info_linelists.append(info_line)

            # info_linelists.append("{:<16}{:<9}{:<8}{:<4}".format(i.replace("_", " "), Machine.item_data[i]["price"],  Machine.item_data[i]["count"], " ".join(Machine.item_data[i]["position"])))
        
        # 将硬币信息转化成图示，按行得到图示列表以备打印
        coin_linelists = ["" for i in range(4)]
        for i in range(3, -1, -1):
            for coin in UserData.user_coins:  
                if (4 - i) > len(coin_pics[coin.value]):
                    coin_linelists[i] += " " * len(coin_pics[coin.value][0])
                else:
                    coin_linelists[i] += coin_pics[coin.value][i - 4]

        # 将贮存硬币信息转化成图示，按行得到图示列表以备打印
        saved_coin_linelists = ["" for i in range(4)]
        for i in range(3, -1, -1):
            for coin in UserData.user_saved_coins:  
                if (4 - i) > len(coin_pics[coin.value]):
                    saved_coin_linelists[i] += " " * len(coin_pics[coin.value][0])
                else:
                    saved_coin_linelists[i] += coin_pics[coin.value][i - 4]



        # 任务信息列表
        task_linelists = ["" for i in range(len(UserData.task_list))]
        for i, task in enumerate(UserData.task_list):
            task: Task
            task_name = space_counter(task.name, 16)
            # 如果任务已经完成，百分比会变成绿色
            if task.is_completed:
                task_percentage = space_counter(makeWordsColor(str(task.complete_percentage) + "%", "green"), 10)
            else:
                task_percentage = space_counter(makeWordsColor(str(task.complete_percentage) + "%", "grey"), 10)
            task_type = space_counter(task.type, 8)
            task_salary = space_counter(makeWordsColor(str(task.salary), "lightyellow"), 10)
            task_content = space_counter(task.content, 4)

            task_line = f"{task_name}{task_percentage}{task_type}{task_salary}{task_content}"
            task_linelists[i] = task_line

        # 将瓶子信息转化成图示，按行得到图示列表以备打印
        # 计算所有图的最大行数
        max_line_count = 0
        for label in bottle_pics:
            if len(bottle_pics[label]) > max_line_count:
                max_line_count = len(bottle_pics[label])

        bottle_linelists = ["" for i in range(max_line_count)]
        for i in range(max_line_count - 1, -1, -1):
            for bottle in UserData.user_bottles:  
                if (max_line_count - i) > len(bottle_pics[bottle.label]):
                    bottle_linelists[i] += " " * my_len(bottle_pics[bottle.label][0])
                else:
                    bottle_linelists[i] += bottle_pics[bottle.label][i - max_line_count]


        # 售货机图案
        MACHINE_PIC = f''' 
  +—————————————————————+                                        
 ╱/////////////////////╱|
+—————————————————————+ |                      Round {UserData.game_round}         
|  Selling  Machine   |╱|
|_____________________| |
|╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|
|│{bs(1, b[0])}││{bs(2, b[1])}││{bs(3, b[2])}││{bs(4, b[3])}││{bs(5, b[4])}││{bs(6, b[5])}││{bs(7, b[6])}│| |
|╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|
|─────────────────────| |
|╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|
|│{bs(1, b[7])}││{bs(2, b[8])}││{bs(3, b[9])}││{bs(4, b[10])}││{bs(5, b[11])}││{bs(6, b[12])}││{bs(7, b[13])}│| |
|╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|
|‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |
| IN \033[90m{Machine.caculateInputSum():04}\033[0m │  ╭╮   ╭╮  | |
|—————————│  ╰╯   ╰╯  | +
|OUT \033[90m{Machine.caculateLastChargeSum():04}\033[0m │Coin Charge|╱|
+—————————+———————————+ |
|   ┌─────────────┐   | |
|   │             │   | |
|   │             │   | +
|   └─────────────┘   |╱
+—————————————————————+

'''
        machine_pic = MACHINE_PIC.split("\n")[1:]

        # 贮存银行图示
        SAVINGS_BANK_PIC = [f"╭────────────────────────────────────╮",
                            f"│╭─╮╭─╮╭─╮╭─╮   Savings Bank     ╭o╮ │",
                            f"│╰─╯╰─╯╰─╯╰─╯                 ╭o╮│ │ │",
                            f"│ ╭────╮            ╭──╮      ╰─╯╰─╯ │",
                            f"│ │    ╰╮           │  ╰╮            │",
                            f"│ │ 500 │ x \033[90m{UserData.user_saved_500_coin_count:03}\033[0m     │100│ x \033[90m{UserData.user_saved_100_coin_count:03}\033[0m      │",
                            f"│ ╰─────╯           ╰───╯            │",
                            f"│                             \033[90m{round(UserData.user_saving_balance / 1000, 1):05.1f}K\033[0m │",
                            f"╰────────────────────────────────────╯"]
        
        def generate_blank(cur_length, goal_length):
            if cur_length >= goal_length:
                return ""
            return (goal_length - cur_length) * " "

        if Uiscreen.page == 1:
            # 逐行打印售货机图案以及售货机右侧的商品信息、硬币图示、购买的瓶子图示、提示信息
            for i in range(len(machine_pic)):
                print(machine_pic[i], end = generate_blank(len(machine_pic[i]), 25))
                if 3 <= i <= 3 + len(info_linelists):
                    print(" " * 5, end = "")
                    if i == 3:
                        print("\033[1m商品名         价格    库存      位置\033[0m", end = "")
                    else:
                        print(info_linelists[i - 4], end = "")

                if 9 < i <= 9 + len(coin_linelists):
                    print(" " * 5, end = "")
                    print(coin_linelists[i - 10], end = "")

                if 14 < i <= 14 + len(bottle_linelists):
                    print(" " * 5, end = "")
                    print(bottle_linelists[i - 15], end = "")

                if i == 23:
                    print(" " * 5, end = "")
                    print(UserData.tip_information, end = "")
                print()

        elif Uiscreen.page == 2:
            # 逐行打印售货机图案以及售货机右侧的任务信息、储存的硬币图示、累计信息等
            for i in range(len(machine_pic)):
                print(machine_pic[i], end = generate_blank(len(machine_pic[i]), 25))
                if 3 <= i <= 3 + len(task_linelists) * 2:
                    print(" " * 5, end = "")
                    if i == 3:
                        print("\033[1m任务名          进度   类型    奖金   内容\033[0m", end = "")
                    elif i % 2 == 0:
                        print(task_linelists[(i - 5) // 2], end = "")
                    elif i % 2 == 1:
                        #print("—" * 82, end = "")
                        pass
                    
                if 9 < i <= 9 + len(coin_linelists):
                    print(" " * 5, end = "")
                    print(coin_linelists[i - 10], end = "")

                if 13 < i <= 13 + len(SAVINGS_BANK_PIC):
                    print(" " * 5, end = "")
                    print(SAVINGS_BANK_PIC[i - 14], end = "")


            
                if i == 23:
                    print(" " * 5, end = "")
                    print(UserData.tip_information, end = "")
                
                
                print()

'''
 ╭─╮    O
╭╯*╰╮  ╭╯╰╮
│100│  │50│  
╰───╯  ╰──╯
   ╭─╮ 
 ╭─╯*╰─╮
 │ 500 │
 ╰─────╯   
╭──╮
│10│
╰──╯
╭─╮
│5│
╰─╯
╭─╮
│1│
╰─╯

 ⌂⏒±※‗‖‡
__
‾‾
₅₆₇₈₉₁₀₂₃₄
⁰¹²³⁴⁵⁶⁷⁸⁹

Name           Price   Vol   Left   Position
pure water       120   500ml   15   [11, 12, 13]
instant coffee   140   400ml   10   [14, 15]
apple juice      150   280ml   8    [16, 17]
peach juice      160   350ml   10   [21, 22, 23]
wheat tea        140   600ml   15   [24, 25, 26, 27]

╭────────────────────────────────────╮
│╭─╮╭─╮╭─╮╭─╮   Savings Bank     ╭o╮ │
│╰─╯╰─╯╰─╯╰─╯   ‾‾‾‾‾‾‾‾‾‾‾‾  ╭o╮│ │ │
│ ╭────╮            ╭──╮      ╰─╯╰─╯ │
│ │    ╰╮           │  ╰╮            │
│ │ 500 │ x 020     │100│ x 020      │
│ ╰─────╯           ╰───╯            │
│                    Balance  001.2k │
╰────────────────────────────────────╯

.. .. .· ··. .·.?
···. ·...·.·.. .· ·...··..· ·..·.。

表示语言：[中文] 已切换

世界名：0A9B134PX9SD1SJ3B348M2M10DF  
世界状态：(0t)021011  
世界状态（自然语言）：稳定循环
世界平均熵增速率：3.823e14J/K*s

通信端口信息：
连接方式：梦境接口
本主机：EDC M50 特快型
终端主机：类计算单位

特定时空1名称：泇鬱超星系团·E03J2DC秩序梦境接口研究星群
坐标：（*DPX加密，*DPX加密，*DPX加密，*DPX加密）
特定时空2名称：拉尼亚凯亚超星系团·室女座超星系团·
              本星系群·银河系·猎户臂·太阳系·地球·
              实体(0t)（38位三进制数）
坐标：（*DPX加密，*DPX加密，*DPX加密，*DPX加密）

连接状态：正在连接......
定位信息：
╭──────────────────────────────────────────────────────────╮ 
│坐标形式：四维时空坐标(ct,  x,   y,   z)                    │
│                    (秒,光年,光年,光年)                  │
│                                                         │
│以泇鬱超星系团·E0DC秩序中心激活瞬间时空为 (0,0,0,0)          │
│向量方向参照概览：                                         │
│                                                          │
│                      z                                   │
│                     ╱                S40                 │
│                    ╱             (1e5,5,-2,2)            │
│                   ╱                                      │
│               E0DC ────────────x                         │
│            (0,0,0,0)-                                    │
│                   ╲    -         ╱                       │
│                    ╲       -    ╱                        │
│                     ╲          -──────                   │
│                      y         ╲   -                     │
│                                 ╲       -                │
│                                             ct           │
│                                                          │
╰──────────────────────────────────────────────────────────╯
[警告：根据主世界秩序保密协议，终端标识及坐标已从向量参考图中移除。]

连接进度：|                     |  0%
连接进度：|xx                   |  10%
连接进度：|xxx                  |  15%
(停3秒)
连接进度：|xxxxxxxxxxxxx        |  60%
连接进度：|xxxxxxxxxxxxxx       |  65%
连接进度：|xxxxxxxxxxxxxxx      |  70%
连接进度：|xxxxxxxxxxxxxxxx     |  75%
连接进度：|xxxxxxxxxxxxxxxxx    |  80%
连接进度：|xxxxxxxxxxxxxxxxxx   |  85%
连接进度：|xxxxxxxxxxxxxxxxxxx  |  90%
连接进度：|xxxxxxxxxxxxxxxxxxxx |  95%
连接进度：|xxxxxxxxxxxxxxxxxxxxx|  99%
(停顿5秒)
连接进度：|xxxxxxxxxxxxxxxxxxxxx|  100%

已连接：类计算单位
[警告： 终端主机的可计算规模远低于基本世界框架的运行需求。仍要继续执行吗？(y/N)]
...cd /Overworld/bottle_world_method
已切换运行路径。
...load all
已预加载所有内容。
未指定输出函数。正在寻找匹配接口的合适函数......
检索到以下输出函数：
1 eye_pixel_print()
2 neuro_control_output()
请为程序输出指定函数(1/2)：
...1
已指定输出函数。
...start main()

（黑屏）
╭──────────────────────────────────────────────────────────╮ 
│  the                                                     │
│  ╭─── ┌─── ┐    ┐    ─┬─ ┌┐ ┬ ╭──┐                       │
│  ╰──╮ ├──  │    │     │  ││ │ │ ─┬                       │
│  ───╯ └─── └─── └─── ─┴─ ┴└─┘ └──┘                       │
│      ┌┬─╮ ╭──╮ ╭──╮ ┬  ┬ ─┬─ ┌┐ ┬ ┌───                   │
│      ││ │ ├──┤ │    ├──┤  │  ││ │ ├──                    │
│      ┘┴ ┘ ┴  ┴ ╰──╯ ┴  ┴ ─┴─ ┴└─┘ └───  TM               │
│                                                          │
│      ————— 售货机物语               ╭─╮                   │
│                                    ├-┤                   │
│               ╭─────────╮         ╭╯ ╰╮                  │
│               │  Start  │         │ ʙɛ│______            │
│               ├─────────┤         │ ɛʀ││‾‾‾‾├╮┌─╱┐       │
│               │ Tutorial│         │   ││café├╯│ D│┌/┐    │
│               ╰─────────╯         ╰───╯╰────╯ ╰──╯╰─╯    │
│                                                          │
│                                                          │
│                                                Beta V1.3 │
╰──────────────────────────────────────────────────────────╯

╭─── ┌─── ┐    ┐    ─┬─ ┌┐ ┬ ╭──┐
╰──╮ ├──  │    │     │  ││ │ │ ─┬
───╯ └─── └─── └─── ─┴─ ┴└─┘ └──┘
 
┌┬─╮ ╭──╮ ╭──╮ ┬  ┬ ─┬─ ┌┐ ┬ ┌───
││ │ ├──┤ │    ├──┤  │  ││ │ ├── 
┘┴ ┘ ┴  ┴ ╰──╯ ┴  ┴ ─┴─ ┴└─┘ └───

╭──╮┐              ┌┐
│   ├─╮╭─╮┌─╮─┼─    │
╰──╯┴ ┴╰─┴├─╯ └─   ─┴─
          ┴     
                               
          
╭────────────────────────────────────────────────────────╮
│                                                        │
│   ╭──╮┐              ┌┐                                │
│   │   ├─╮╭─╮┌─╮─┼─    │                 ─┬───┬─        │
│   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─                 │   │         │
│             ┴                         ───┼───┼───      │
│                                          │   │         │
│                                          │   │         │
│                                                        │   
│                                                        │
│                                                        │
│                                        ┐   │ │ │       │
│                                       ─┴─  └─┴─┘       │
│                                       │ │ ───┬───      │
│                                       ─── ┌─┬┴┬─┐      │
│                                           │ │ │ │      │
│    我们的旅途，                                         │
│                                                        │
│       从这里开始。                 难度  ■ □ □ □ □      │
│                                                        │
╰────────────────────────────────────────────────────────╯
╭────────────────────────────────────────────────────────╮
│                                                        │
│   ╭──╮┐              ┌─┐                               │
│   │   ├─╮╭─╮┌─╮─┼─   ┌─┘              ─┐  ─┬──┬─       │
│   ╰──╯┴ ┴╰─┴├─╯ └─   └──              ─┐  ┌┼──┼┐       │
│             ┴                             ││  ││       │
│                                        │  │ ── │       │
│                                       ─┘  └────┘       │
│                                                        │   
│                                                        │
│                                             ───        │
│                                        ──  ├─┬─┐       │
│                                       ─┬── ├─┼─┤       │
│                                        │   └─┼─┘       │
│                                        └─┘  ╱│ └┘      │
│                                            ╱ └───┘     │
│    对酒当歌，                                          │
│                                                        │
│       人生几何？                 难度  ■ ■ □ □ □      │
│                                                        │
╰────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐              ┌─┐          章  节  介  绍        │
│   │   ├─╮╭─╮┌─╮─┼─   ┌─┘     ───────────────────────    │
│   ╰──╯┴ ┴╰─┴├─╯ └─   └──     I N T R O D U C T I O N    │
│             ┴                                           │
│   ┌─────────────────────────────────────────────────┐   │
│   │    初次体验，感觉如何？                          │   │
│   │                                                │   │   
│   │    前方是“酒鬼”的家园：我们为您添置了“酒精饮料”，一│   │
│   │种喝下去苦，但也会损害细胞的垃圾饮料。             │   │
│   │                                                 │   │                   
│   │    即便如此，大量的人沉迷酒精，为求那一刻的怅然   │   │
│   │与沉醉。这一点上，人类文明与我们的文明并无差别，尽管│   │
│   │我们喝的是另一种星际麻醉饮料。                   │   │
│   │                                                 │   │
│   │    本章的基底饮料为：                       │   │
│   │         水、酸奶、果汁、茶、酒精饮料             │   │
│   │                                                 │   │
│   │                                                 │   │
│   └─────────────────────────────────────────────────┘   │
│                                                         │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐              ┌─┐           章 节 一 览          │
│   │   ├─╮╭─╮┌─╮─┼─   ┌─┘       ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─   └──          P R E V I E W         │
│             ┴                                           │
│                                                         │
│                                                         │
│     ╭o╮ ╭o╮ ╭o╮          ╭o╮ 醉生        醇厚            │
│     │~│ │J│ │T│    +     │Å│ 梦死   ┌─╱┐ 绵柔            │ 
│     ╰─╯ ╰─╯ ╰─╯          ╰─╯       ╰──╯                 │ 
│     水  果汁 茶            酒         酸奶                │ 
│                                                         │
│                                                         │
│       ___              ╭┬──╮             ┌─────│╮       │ 
│    ╭──╯│╰╮    │___│    │╰──┤    ┌──╱┐    │.....││       │
│    │  o┼o│    │   │    │  ʙ│    │D╱D│    │.oo..││       │ 
│    │ψ  ┼o│    ╰─╥─╯    │   │    │ D │    │.O..o.│       │      
│    ╰─────╯     ─╨─     ╰───╯    ╰───╯    ╰──────╯       │       
│      果茶      ???      ???      ???        ???         │
│                                                         │ 
╰─────────────────────────────────────────────────────────╯

  ─┐  ─┬──┬─
  ─┐  ┌┼──┼┐
      ││  ││
   │  │ ── │
  ─┘  └────┘

        ───
   ──  ├─┬─┐ 
  ─┬── ├─┼─┤
   │   └─┼─┘
   └─┘  ╱│ └┘       
       ╱ └───┘        


  

╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐              ┌┐           章  节  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─    │      ───────────────────────    │
│   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─     I N T R O D U C T I O N    │
│             ┴                                           │
│   ┌─────────────────────────────────────────────────┐   │
│   │    欢迎来到异次元的世界！                         │   │
│   │    本时空的文明以高度发达的售卖系统著称。           │   │   
│   │    但我们不卖其他，只卖一种物品：瓶装饮料。         │   │
│   │                                                 │   │
│   │    这解释起来有些复杂。比如说，我们不需要摄入固体， │   │
│   │而以电池酸液和烷烃饮料为生。进一步解释我们的构造容易 │   │
│   │产生不必要的困惑。                                │   │
│   │    幸运的是，本章提供的五种饮料：                 │   │
│   │            水、咖啡、果汁、茶、牛奶               │   │
│   │    均为地球上最常见的饮料种类。[统计编号0328]      │   │
│   │                                                 │   │
│   │                                                 │   │
│   └─────────────────────────────────────────────────┘   │
│                                                         │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐              ┌┐            章 节 一 览           │
│   │   ├─╮╭─╮┌─╮─┼─    │        ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─          P R E V I E W         │
│             ┴                                           │
│                                                         │
│                                                         │
│    ╭o╮ 生命   ╭o╮ 醇香   ╭o╮ 酸甜  ╭o╮ 一盏  ╭o╮ 素液     │
│    │~│ 之源   │É│ 提神   │J│ 可口  │T│ 清欢  │M│ 润心     │ 
│    ╰─╯        ╰─╯       ╰─╯       ╰─╯       ╰─╯         │ 
│    水         咖啡       果汁      茶        牛奶        │ 
│                                                         │
│                                                         │
│                                    ___                  │ 
│    ______    ┬──╱─┬   ┬──╱─┬    ╭──╯│╰╮                 │
│    │‾‾‾‾├╮   │~╱~~│   │*╱~*│    │  o┼o│                 │ 
│    │café├╯   │╱ooo│   │╱~*~│    │ψ  ┼o│                 │
│    ╰────╯    ╰────╯   ╰────╯    ╰─────╯                 │ 
│      ???      ???       ???        ???                  │
│                                                         │ 
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐              ┌┐            章 末 小 结          │
│   │   ├─╮╭─╮┌─╮─┼─    │        ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─   ─┴─          S U M M A R Y         │
│             ┴                                           │
│                                                         │
│     在你巧夺天工的双手下，诞生了琳琅满目的地球饮料组合！  │
│                                                         │
│     顺利通过第一章！                                    │
╰─────────────────────────────────────────────────────────╯
    额外任务       完成度                            奖励

     

合计：
 >>> 按回车进入第二章。
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     饮料分为基底饮料和混合饮料两种。                       │
│                                                         │ 
│                                                         │ 
│                                        _______          │
│            ╭o╮╭〇╮                 ╭┬─╮│‾‾‾‾‾├╮         │
│         ╭o╮│T││  │            ┬─╱─┬│╰─┤│     ││         │ 
│      ╭o╮│M││ ││  │            │╱oo││ ʙ││ café├╯         │
│      ╰─╯╰─╯╰─╯╰──╯            ╰───╯╰──╯╰─────╯          │
│                                                         │ 
│         基底饮料                   混合饮料              │
│                                                         │
│                                                         │ 
│                                                         │
│                                                         │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     基底饮料是饮料的“最小单位”，                          │
│                                                         │
│     将基底饮料按照一定方式混合可得到混合饮料。              │ 
│     例如：                                              │ 
│                                                         │ 
│                                                         │
│          ╭o╮           ╭o╮             ┬─╱─┬            │
│          │M│     +     │T│     -->     │╱oo│            │ 
│          ╰─╯           ╰─╯             ╰───╯            │
│          牛奶           茶              奶茶             │
│          500ml        500ml            1000ml           │ 
│                                                         │ 
│                                                         │
│                                                         │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     基底饮料的种类和体积大小决定了混合饮料的种类和大小。    │
│                                                         │
│     基底饮料体积相加为混合饮料的体积。例如：               │
│                                                         │ 
│          ╭o╮           ╭o╮             ┬─╱─┬            │ 
│          │M│     +     │T│     -->     │╱oo│            │ 
│          ╰─╯           ╰─╯             ╰───╯            │ 
│         正常瓶         正常瓶           迷你杯            │
│         500ml          500ml           1000ml           │
│                                                         │
│                        ╭o╮             ┬──╱─┬           │
│          ╭o╮           │T│             │~╱~~│           │
│          │M│     +     │ │     -->     │╱ooo│           │ 
│          ╰─╯           ╰─╯             ╰────╯           │
│         正常瓶         大号瓶            正常杯           │
│         500ml          750ml            1250ml          │ 
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     更多示例：                                           │
│                                                         │
│          ╭o╮           ╭o╮             ┬─╱─┬            │ 
│          │M│     +     │T│     -->     │╱oo│            │ 
│          ╰─╯           ╰─╯             ╰───╯            │ 
│          牛奶           茶              奶茶             │
│                                                         │
│                                        ____             │
│          ╭o╮           ╭o╮             │‾‾├╮            │
│          │M│     +     │É│     -->     │fé├╯            │ 
│          ╰─╯           ╰─╯             ╰──╯             │
│          牛奶          咖啡            卡布奇诺          │
│                                                         │ 
│                                                         │
│                                                         │
│                                                         │ 
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     不妥当的混合方式会产生毒药：                          │                
│                                        ____             │
│          ╭o╮           ╭o╮             │‾‾├╮            │
│          │M│     +     │É│     -->     │fé├╯            │ 
│          ╰─╯           ╰─╯             ╰──╯             │
│          牛奶          咖啡            卡布奇诺          │
│                                                         │ 
│                                        ____             │
│          ╭o╮           ╭o╮             │  │             │
│          │J│     +     │É│     -->     │╳╳│             │
│          ╰─╯           ╰─╯             ╰──╯             │ 
│          果汁          咖啡             毒药             │
│                                                         │
│                                                         │ 
│     毒药会导致扣钱（钱的概念即将在后面的介绍中出现）        │ 
│                                                         │ 
│     一般来说，地球现实生活中不曾想象的黑暗组合才会产生毒药。 │                                     
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     两次以上的混合在后续章节会陆续出现。                   │                
│     在本章，这种混合均会产生毒药：                         │
│                                                         │
│                                                         │ 
│          ____                           ______          │ 
│          │‾‾├╮          ┬─╱─┬           │    │          │
│          │fé├╯    +     │╱oo│   -->     │╳╳╳╳│          │ 
│          ╰──╯           ╰───╯           ╰────╯          │
│         卡布奇诺         奶茶             毒药           │
│          迷你            迷你             正常           │ 
│                                                         │
│                                                         │ 
│                                                         │ 
│                                                         │
│                                                         │ 
│                                                         │ 
│                                                         │ 
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     绝大多数基底饮料拥有迷你、正常、长、大号四种型号的变种。 │                                                 
│                                                         │
│                                                         │
│                       ╭o╮    ╭〇╮                       │ 
│                ╭o╮    │M│    │ M│                       │
│         ╭o╮    │M│    │ │    │  │                       │
│         ╰─╯    ╰─╯    ╰─╯    ╰──╯                       │ 
│         迷你   正常    长     大号                       │
│                                                         │
│     其体积分别为：                                       │            
│                                                         │
│        250ml  500ml  750ml   1000ml                     │
│                                                         │
│                                                         │
│     体积是混合时游戏参考的标准，达到某一数值瓶子的大小会改变 │
│                                                         │                                     
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     购买得到的基底瓶子的大小是随机的，有大有小。            │
│     更大体积的饮料能在出售时卖得更多的钱，所以升级你的瓶子大 │
│   小相当重要。以下是升级大小的常见方法：                   │                                
│                                                         │
│     · 将同名瓶子混合：                                   │
│                                      ╭o╮                │ 
│        ╭o╮           ╭o╮             │M│                │
│        │M│     +     │M│     -->     │ │                │ 
│        ╰─╯           ╰─╯             ╰─╯                │
│        正常          正常             长                 │ 
│                                                         │
│                                                _______  │ 
│        ____          ____            ______    │‾‾‾‾‾├╮ │
│        │‾‾├╮         │‾‾├╮           │‾‾‾‾├╮   │     ││ │ 
│        │fé├╯   +     │fé├╯   -->     │café├╯   │ café├╯ │
│        ╰──╯          ╰──╯            ╰────╯    ╰─────╯  │ 
│        迷你          迷你              正常  or   大号   │
│                                    总1250ml+   总2000ml+│                                     
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     水是一种特殊的基底饮料。任何饮料与水混合，在保留该饮料的 │
│   同时会扩大饮料的体积，且本游戏并无“稀释”的概念。          │
│                                                         │
│     · 将其他饮料与水混合：                                │
│                                      ╭o╮                │ 
│        ╭o╮           ╭o╮             │M│                │
│        │M│     +     │~│     -->     │ │                │ 
│        ╰─╯           ╰─╯             ╰─╯                │
│        正常          正常             长                 │ 
│                                                         │
│                                                         │ 
│        ____                          ______             │
│        │‾‾├╮         ╭o╮             │‾‾‾‾├╮            │ 
│        │fé├╯   +     │~│     -->     │café├╯            │
│        ╰──╯          ╰─╯             ╰────╯             │ 
│        迷你          正常              正常              │
│                                                         │                                     
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     有一种特殊的饮料，称为“幸运瓶子”。购买售货机里的商品有概 │
│   率获得正常大小且带问号的幸运瓶子。在结算时，它的结算价格是 │
│   随机的。                                              │
│                                                         │ 
│     任何其他饮料与幸运瓶子混合，都将保留并扩大幸运瓶子。    │ 
│     两个幸运瓶子混合可以得到双拼幸运瓶子。                 │
│                                        ╭o╮              │
│        ╭o╮           ┬─╱─┬             │?│              │
│        │?│     +     │╱oo│     -->     │ │              │
│        ╰─╯           ╰───╯             ╰─╯              │
│      幸运瓶子         奶茶            幸运瓶子            │
│                                                         │ 
│        ╭o╮            ╭o╮             ╭o╮╭o╮            │
│        │?│     +      │?│      -->    │?├┤?│            │
│        ╰─╯            ╰─╯             ╰─╯╰─╯            │  
│      幸运瓶子        幸运瓶子        双拼幸运瓶子         │      
│                                                         │    
│     或许，你可以尝试用幸运瓶子来覆盖不小心得到的毒药。      │                                                                            
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭──╮┐                           规  则  介  绍         │
│   │   ├─╮╭─╮┌─╮─┼─             ───────────────────      │
│   ╰──╯┴ ┴╰─┴├─╯ └─                  R U L E S           │
│             ┴                                           │
│                                                         │
│     介绍完饮料的知识，我们将视野移向货币系统。              │
│                                                         │
│     以下是6种游戏的“芯片硬币”，是游戏的通用货币。          │                                       
│                                                         │
│                                                         │
│          ╭────╮  ╭──╮  ╭─╮                              │ 
│          │    ╰╮ │  ╰╮ │ ╰╮ ╭──╮ ╭─╮ ╭─╮                │ 
│          │ 500 │ │100│ │50│ │10│ │5│ │1│                │  
│          ╰─────╯ ╰───╯ ╰──╯ ╰──╯ ╰─╯ ╰─╯                │
│                                                         │  
│     上面的数字代表硬币的面值。                            │
│                                                         │ 
│     芯片硬币是你在本世界通行的前提，用该硬币在“饮料售货机”中 │
│   购买多种基底饮料，混合他们来拍卖以赚取更多硬币。          │ 
│                                                         │  
│     当你的硬币亏损到不足以购买任何饮料时，你就失败了。      │     
╰─────────────────────────────────────────────────────────╯

╭─────────────────────────────────────────────────────────╮
│    +—————————————————————+                              │
│   ╱/////////////////////╱|                              │
│  +—————————————————————+ |  这就是我们引以为傲的售货机。  │
│  |  Selling  Machine   |╱|  一共有两行，每行7个售卖位置。 │
│  |_____________________| |                              │
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|  ╭────╮ ╭────╮               │
│  |│1││2││3││4││5││6││7│| |  │    ╰╮│    ╰╮              │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|  │ 500 ││ 500 │              │
│  |─────────────────────| |  ╰─────╯╰─────╯              │
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|                              │
│  |│1││2││3││4││5││6││7│| |  上面是你的初始硬币。          │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|  游戏正式开始时，键入“500”数字 │
│  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |  以完成一次投币。             │
│  | IN 0000 │  ╭╮   ╭╮  | |                              │
│  |—————————│  ╰╯   ╰╯  | +  键入想要购买的饮料位置，      │
│  |OUT 0000 │Coin Charge|╱|  例如“A2” “B1”等，以完成购买。│
│  +—————————+———————————+ |                              │
│  |   ┌─────────────┐   | |  购买后会自动找零。            │
│  |   │             │   | |  如果想要先退回投入售货机的硬币 │
│  |   │             │   | +  请键入“退钱”。               │
│  |   └─────────────┘   |╱   此操作不能退还已经交易过的硬币│
│  +—————————————————————+                                │
╰─────────────────────────────────────────────────────────╯

╭─────────────────────────────────────────────────────────╮
│    +—————————————————————+                              │
│   ╱/////////////////////╱|                              │
│  +—————————————————————+ |  购买后，饮料瓶会依序排列在售货 │
│  |  Selling  Machine   |╱|  机的右侧偏下的位置。          │
│  |_____________________| |                              │
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|  如下图：                     │
│  |│1││2││3││4││5││6││7│| |  序号依次为：1, 2, 3, 4       │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                              │
│  |─────────────────────| |  待剩下的钱不足以买任何一种饮料│
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|  时，才能开始混合阶段：        │
│  |│1││2││3││4││5││6││7│| |                              │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                              │
│  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |         ╭o╮                  │
│  | IN 0000 │  ╭╮   ╭╮  | |   ╭o╮╭o╮│ │╭o╮               │
│  |—————————│  ╰╯   ╰╯  | +   │M││T││ ││É│               │
│  |OUT 0000 │Coin Charge|╱|   ╰─╯╰─╯╰─╯╰─╯               │
│  +—————————+———————————+ |                              │
│  |   ┌─────────────┐   | |  混合时，键入“1+4”代表混合第一 │
│  |   │             │   | |  个瓶子与第四个瓶子           │
│  |   │             │   | +                              │
│  |   └─────────────┘   |╱   你认为所有混合已经完成时，    │
│  +—————————————————————+    键入“结算”来结算本回合的饮料。│
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│    +—————————————————————+                              │
│   ╱/////////////////////╱|                              │
│  +—————————————————————+ |   主界面一共有2页。 刚才向你介 │
│  |  Selling  Machine   |╱|   绍的内容为第1页。           │
│  |_____________________| |                              │
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|A|   要切换页面，键入“P2”至第2页  │
│  |│1││2││3││4││5││6││7│| |              键入“P1”至第1页  │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|                              │
│  |─────────────────────| |   第 1 页功能：               │
│  |╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮╭o╮|B|                              │
│  |│1││2││3││4││5││6││7│| |        · 投币                │
│  |╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯╰─╯|╱|        · 购买基底饮料         │
│  |‾‾‾‾‾‾‾‾‾│‾‾‾‾‾‾‾‾‾‾‾| |        · 混合（不能购买之后）  │
│  | IN 0000 │  ╭╮   ╭╮  | |        · 结算                │
│  |—————————│  ╰╯   ╰╯  | +                              │
│  |OUT 0000 │Coin Charge|╱|   第 2 页功能：               │
│  +—————————+———————————+ |                              │
│  |   ┌─────────────┐   | |        · 查看章节附加任务进度  │
│  |   │             │   | |        · 储蓄卡存钱/取钱      │
│  |   │             │   | +                              │
│  |   └─────────────┘   |╱                               │
│  +—————————————————————+                                │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│   ╭────────────────────────────────────╮                │
│   │╭─╮╭─╮╭─╮╭─╮   Savings Bank     ╭o╮ │                │
│   │╰─╯╰─╯╰─╯╰─╯                 ╭o╮│ │ │                │
│   │ ╭────╮            ╭──╮      ╰─╯╰─╯ │                │
│   │ │    ╰╮           │  ╰╮            │                │ 
│   │ │ 500 │ x  000    │100│ x  000     │                │
│   │ ╰─────╯           ╰───╯            │                │
│   │                             000.0k │                │
│   ╰────────────────────────────────────╯                │
│   这是你的储蓄卡。                                       │
│   如果你不想每次都必须在回合内花完所有的钱，你可以选择存钱至 │
│ 储蓄卡。储蓄卡内的硬币将保留至之后的回合中。当你一回合破产但 │
│ 储蓄卡内还有存余时，你不会立刻结束游戏。                   │
│                                                         │
│    储蓄卡仅支持大额硬币（100/500）存入。                   │
│    使用方法：进入第 2 页， 输入S100/S500 表示存100/500     │
│                          输入W100/w500 表示取100/500     │
│                                                         │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│            一 些 可 能 对 你 有 用 的 信 息               │
│                                                         │
│                                                         │
│     · 回合结束结算的拍卖价格：                            │
│                                                         │
│                水：        购入价 x 0.3                  │
│       其他基底饮料：        购入价 x 0.65                │
│           混合饮料：       混合前两者购入价之和 x 1.2     │
│              毒药：        -200                         │
│           幸运瓶子：       期望值100，极差800             │
│                           （在-300~500间随机）           │
│       双拼幸运瓶子：       期望值200，极差1720            │
│                           （在-600~1120间随机)           │
│                                                         │
│     · 瓶子尺寸的价格倍率加成：                            │
│                                                         │
│              迷你：       价格 x 0.7                     │
│              正常：       价格 x 1.0                     │
│              长：         价格 x 1.3                     │
│              大号：       价格 x 1.6                     │
│       (幸运瓶子）                                        │
│              长长：       价格 x 2.0                     │
│            长长长：       价格 x 3.0                     │
│                                                         │
│   因此，尽可能多的混合瓶子，并适当地用水扩大体积，是较为划算 │
│ 的方式。                                                 │
╰─────────────────────────────────────────────────────────╯
╭─────────────────────────────────────────────────────────╮
│                                                         │
│            一 些 可 能 对 你 有 用 的 信 息               │
│                                                         │
│                                                         │
│     · 每过1个回合，售货机贩卖物品的价格都会通胀。不过在结算  │
│       饮料时价格也会乘以相同的倍率。                       │
│                                                         │
│         新的售价为：   旧价格 * 110%                     │
│                                                         │
│       新的结算价为：   旧价格 * 110%                     │
│                                                         │
│       但储蓄卡的金额并不会改变。                          │
│                                                         │
│     · 每过1个回合，售货机都会随机补充随机数量的商品。       │
│                                                         │
│     · 每3回合为一章节，每一章节都会解锁一些全新的基底饮料。 │
│       全新的混合饮料的配置方法默认保密，需要自行探索得到答案│
│       可以去图鉴（尚未完工）中查看已经遇到的各种饮料。      │
│                                                         │
│     · 售货机购买的瓶子上面的字样是否生成是随机的。随着游戏的 │
│       深入，生成字样的概率会越来越低。字样用于提示瓶子的内容 │
│       物，所以到后期记忆购买瓶子的顺序格外重要，以尽量减少混 │
│       合失误。                                           │
│       迷你瓶子均无字样，随着游戏的进行生成概率会提高。      │
│       常见的字样为：                                     │
│                                                         │
│          M  -->  milk   牛奶         ╭o╮    ╭o╮         │
│          J  -->  juice  果汁         │ │    │M│         │
│          T  -->  tea    茶           ╰─╯    ╰─╯         │
│          É  -->  coffee 咖啡        无字样  有字样       │
│          ?  -->         幸运瓶                          │
│                                                         │
│                                        AlexDreemurr     │
│                                            25.08.27     │
╰─────────────────────────────────────────────────────────╯








■◻■□◪▫▪▢▥▨▩▮▯▤▧●○◍◌◓


       ╭───╮
       │ W │
       ╰───╯
    ─┬───┬─
     │   │
  ───┼───┼───
     │   │
     │   │

    
   ┐   │ │ │
  ─┴─  └─┴─┘
  │ │ ───┬───
  ─── ┌─┬┴┬─┐
      │ │ │ │

'''

